Autodesk.Revit.DB.Grid.GetExtents
Gets the extents of the grid in the model.
Remarks: The extents are the 3D bounding box surrounding the grid.  The Z coordinates of the box are used by
Revit to determine if the grid should be displayed in a corresponding view plan (if the grid is linear). The
extents are not used for arc grids.
Since: 2013

Autodesk.Revit.DB.Grid.ExtendToAllLevels
Adjust the grid to cut all levels.
Remarks: Requires that at least one plan view exists in the document. If not, this will throw a Autodesk::Revit::Exceptions::InvalidOperationException.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: There is no plan view in the document.

Autodesk.Revit.DB.Grid.GridType
Get and Set the type of the grid object.
Remarks: When null is input for the method set, ArgumentNullException will be thrown.

Autodesk.Revit.DB.Grid.IsCurved
Test to see if the grid line is curved or straight.
Remarks: A value of True is returned if the grid line is an arc or False if the grid line is
straight. Use the Curve property to retrieve an object that represents the geometry of the grid
line.

Autodesk.Revit.DB.Grid
Represents a single grid line within Autodesk Revit.
Remarks: Grid lines can either be curved or straight. The
Name property can be used to retrieve the contents of the grid line's bubble.